In [30]:
import pandas as pd

In [31]:
friend = [
    {'age' : 25, 'job':'student'},
    {'age': 30, 'job':'teacher'},
    {'age': 31, 'job':'developer'}
]
df = pd.DataFrame(friend, index = ['John','Jenny','Nate'], columns=['age','job'])
df

       age        job
John    25    student
Jenny   30    teacher
Nate    31  developer

In [32]:
df.drop(['John','Nate'])
# df.drop(['John','Nate'], inplace = True) #inplace하게되면 따로 df에 저장안해도 저장됌

       age      job
Jenny   30  teacher

In [33]:
friend = [
    {'age' : 25, 'job':'student'},
    {'age': 30, 'job':'teacher'},
    {'age': 31, 'job':'developer'}
]
df = pd.DataFrame(friend, index = ['John','Jenny','Nate'], columns=['age','job'])
df

       age        job
John    25    student
Jenny   30    teacher
Nate    31  developer

In [34]:
df.drop(df.index[[0,2]]) #원하는 row삭제

       age      job
Jenny   30  teacher

In [35]:
df.drop('age', axis=1) #column에서 age삭제

             job
John     student
Jenny    teacher
Nate   developer

In [36]:
df['salary'] = 0
df['hobby'] = 'soccer','music','game'

df

       age        job  salary   hobby
John    25    student       0  soccer
Jenny   30    teacher       0   music
Nate    31  developer       0    game

In [37]:
import numpy as np
df['salary'] = np.where(df['job'] != 'student','yes','no')
df.head()

       age        job salary   hobby
John    25    student     no  soccer
Jenny   30    teacher    yes   music
Nate    31  developer    yes    game

In [38]:
df['midterm'] = 95,85,30
df['final'] = 85,80,10
df.head()

       age        job salary   hobby  midterm  final
John    25    student     no  soccer       95     85
Jenny   30    teacher    yes   music       85     80
Nate    31  developer    yes    game       30     10

In [39]:
df['total'] = df['midterm'] + df['final']
df.head()

       age        job salary   hobby  midterm  final  total
John    25    student     no  soccer       95     85    180
Jenny   30    teacher    yes   music       85     80    165
Nate    31  developer    yes    game       30     10     40

In [40]:
df['average'] = df['total'] / 2
df.head()

       age        job salary   hobby  midterm  final  total  average
John    25    student     no  soccer       95     85    180     90.0
Jenny   30    teacher    yes   music       85     80    165     82.5
Nate    31  developer    yes    game       30     10     40     20.0

In [41]:
grades = []
for row in df['average']:
    if row >= 90:
        grades.append('A')
    elif row >= 80:
        grades.append('B')
    else:
        grades.append('F')
df['grade'] = grades
df.head()

       age        job salary   hobby  midterm  final  total  average grade
John    25    student     no  soccer       95     85    180     90.0     A
Jenny   30    teacher    yes   music       85     80    165     82.5     B
Nate    31  developer    yes    game       30     10     40     20.0     F

In [42]:
def pass_or_fail(row):
    if row != 'F':
        return "PASS"
    else:
        return "FAIL"
df.grade = df.grade.apply(pass_or_fail)
df.head()

       age        job salary   hobby  midterm  final  total  average grade
John    25    student     no  soccer       95     85    180     90.0  PASS
Jenny   30    teacher    yes   music       85     80    165     82.5  PASS
Nate    31  developer    yes    game       30     10     40     20.0  FAIL

In [43]:
date_list = [
    {'yyyy-mm-dd' : '2020-01-01'},
    {'yyyy-mm-dd' : '2021-02-01'},
]
df = pd.DataFrame(date_list,columns = ['yyyy-mm-dd'])
df.head()

   yyyy-mm-dd
0  2020-01-01
1  2021-02-01

In [46]:
def extract_year(row):
    return row.split('-')[0]
df['year'] = df['yyyy-mm-dd'].apply(extract_year)
df.head()

   yyyy-mm-dd  year
0  2020-01-01  2020
1  2021-02-01  2021

In [54]:
def get_age(year, currnet_year):
    return currnet_year - int(year)
df['age'] = df['year'].apply(get_age,currnet_year=2018)
df

   yyyy-mm-dd  year  age          introduce
0  2020-01-01  2020   -2  I amage years old
1  2021-02-01  2021   -3  I amage years old

In [70]:
def get_introduce(age,prefix,suffix):
    return prefix + str(age) + suffix 
df['introduce'] = df['age'].apply(get_introduce, prefix="I am",suffix=" years old")
df

   yyyy-mm-dd  year  age         introduce                      introduce2
0  2020-01-01  2020   -2  I am-2 years old  i was born in 2020 my age is-2
1  2021-02-01  2021   -3  I am-3 years old  i was born in 2021 my age is-3

In [71]:
def get_introduce_2(row):
    return "i was born in " + str(row.year) + " my age is" + str(row.age)
# df.introduce = df.apply(get_introduce_2, axis=1)
df['introduce2'] = df.apply(get_introduce_2, axis=1)
df

   yyyy-mm-dd  year  age         introduce                      introduce2
0  2020-01-01  2020   -2  I am-2 years old  i was born in 2020 my age is-2
1  2021-02-01  2021   -3  I am-3 years old  i was born in 2021 my age is-3

In [46]:
scores = [
    {'name' : 'John', 'midterm': 90, 'final':85},
    {'name' : 'Jassy', 'midterm': 85, 'final':80},
    {'name' : 'carrick', 'midterm': 50, 'final':85},
]
df = pd.DataFrame(scores, columns=['name','midterm','final'])
df.head()

      name  midterm  final
0     John       90     85
1    Jassy       85     80
2  carrick       50     85

In [49]:
df2 = pd.DataFrame(
    [['Ben',50,50]], columns = ['name','midterm','final']
)
df2.head()

  name  midterm  final
0  Ben       50     50

In [50]:
df.append(df2, ignore_index = True)  #표 합치기

      name  midterm  final
0     John       90     85
1    Jassy       85     80
2  carrick       50     85
3      Ben       50     50